---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.ExternalServiceId
source: html/e29c756b-aa11-a6a4-ffec-3ba6212d55f9.htm
---
# ExternalServiceId Methods

Compares two Guid-based enum object based on their concrete class and GUID value.